# University Management Database
![ER-Diagram](https://raw.githubusercontent.com/LKJTC/Database-Project/refs/heads/main/DB-ER.png)

In [30]:
!pip3 install psycopg2

Requirement already satisfied: psycopg2 in c:\users\c0ns0\miniconda3\envs\iccs\lib\site-packages (2.9.10)

In [31]:
%reload_ext sql

In [32]:
%%sql
postgresql://root:OCYBctG0iRluMrOjb6GI4jxVLVk8VBil@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo

In [33]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [34]:
%%sql

DROP TABLE IF EXISTS Facility CASCADE;
DROP TABLE IF EXISTS Student CASCADE;
DROP TABLE IF EXISTS PersonalInfo CASCADE;
DROP TABLE IF EXISTS Course CASCADE;
DROP TABLE IF EXISTS Instructor CASCADE;
DROP TABLE IF EXISTS Enrollment CASCADE;
DROP TABLE IF EXISTS FacilityUsage CASCADE;

CREATE TABLE Student (
    studentId INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    birthDate DATE,
    contactInfo VARCHAR(255),
    major VARCHAR(255)
);

CREATE TABLE PersonalInfo (
    studentId INT PRIMARY KEY,
    address VARCHAR(255),
    phoneNumber VARCHAR(20),
    email VARCHAR(255),
    emergencyContact VARCHAR(255),
    FOREIGN KEY (studentId) REFERENCES Student(studentId)
);

CREATE TABLE Instructor (
    instructorId INT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    department VARCHAR(255),
    contractInfo VARCHAR(255)
);

CREATE TABLE Course (
    courseId INT PRIMARY KEY,
    courseName VARCHAR(255) NOT NULL,
    credits INT,
    schedule VARCHAR(255),
    location VARCHAR(255),
    instructorId INT,
    FOREIGN KEY (instructorId) REFERENCES Instructor(instructorId)
);

CREATE TABLE Enrollment (
    enrollmentId INT PRIMARY KEY,
    studentId INT,
    courseId INT,
    semester VARCHAR(50),
    grade CHAR(2),
    credits INT,
    FOREIGN KEY (studentId) REFERENCES Student(studentId),
    FOREIGN KEY (courseId) REFERENCES Course(courseId)
);

CREATE TABLE Facility (
    facilityId INT PRIMARY KEY,
    facilityName VARCHAR(255) NOT NULL,
    facilityType VARCHAR(255),
    location VARCHAR(255)
);

CREATE TABLE FacilityUsage (
    reservationId INT PRIMARY KEY,
    studentId INT,
    facilityId INT,
    usageDateTime TIMESTAMP,
    duration INT,
    FOREIGN KEY (studentId) REFERENCES Student(studentId),
    FOREIGN KEY (facilityId) REFERENCES Facility(facilityId)
);

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [35]:
%%sql

INSERT INTO Student (studentId, name, birthDate, contactInfo, major) VALUES
(100001, 'John Doe', '2001-06-15', 'john.doe@example.com', 'Computer Science'),
(100002, 'Jane Smith', '2002-07-20', 'jane.smith@example.com', 'Business Administration'),
(100003, 'Alice Johnson', '2000-09-10', 'alice.j@example.com', 'Chemistry'),
(100004, 'Chris Lee', '2003-11-25', 'chris.lee@example.com', 'Media and Communication'),
(100005, 'David Brown', '1999-01-30', 'david.brown@example.com', 'Applied Mathematics'),
(100006, 'Emma Wilson', '2002-05-22', 'emma.wilson@example.com', 'Biological Sciences'),
(100007, 'Michael Davis', '2001-03-18', 'michael.davis@example.com', 'Computer Engineering'),
(100008, 'Sophia Martinez', '2002-08-15', 'sophia.m@example.com', 'International Relations and Global Affairs'),
(100009, 'James Taylor', '2001-02-09', 'james.taylor@example.com', 'Humanities and Language'),
(100010, 'Isabella Thomas', '2003-12-12', 'isabella.t@example.com', 'Food Science and Technology'),
(100011, 'William Jackson', '2001-10-14', 'william.jackson@example.com', 'Creative Technology'),
(100012, 'Olivia Harris', '1998-04-23', 'olivia.harris@example.com', 'Communication Design'),
(100013, 'Lucas Clark', '2002-06-30', 'lucas.clark@example.com', 'Computer Science'),
(100014, 'Charlotte Lewis', '1999-07-19', 'charlotte.lewis@example.com', 'Business Administration'),
(100015, 'Ethan Walker', '2000-08-25', 'ethan.walker@example.com', 'Chemistry'),
(100016, 'Mia Hall', '2003-09-15', 'mia.hall@example.com', 'Media and Communication'),
(100017, 'Benjamin Allen', '1998-10-05', 'benjamin.allen@example.com', 'Applied Mathematics'),
(100018, 'Amelia Young', '2001-11-11', 'amelia.young@example.com', 'Biological Sciences'),
(100019, 'Alexander Moore', '2002-12-22', 'alexander.moore@example.com', 'Computer Engineering'),
(100020, 'Evelyn Martin', '2003-03-30', 'evelyn.martin@example.com', 'International Relations and Global Affairs'),
(100021, 'Logan Anderson', '1999-05-01', 'logan.anderson@example.com', 'Humanities and Language'),
(100022, 'Lily White', '2002-07-24', 'lily.white@example.com', 'Food Science and Technology'),
(100023, 'Jacob Wright', '2001-01-19', 'jacob.wright@example.com', 'Creative Technology'),
(100024, 'Aria King', '2003-04-03', 'aria.king@example.com', 'Communication Design'),
(100025, 'Nathan Scott', '2000-02-28', 'nathan.scott@example.com', 'Computer Science'),
(100026, 'Zoey Adams', '2002-03-15', 'zoey.adams@example.com', 'Business Administration'),
(100027, 'Liam Nelson', '2003-05-10', 'liam.nelson@example.com', 'Chemistry'),
(100028, 'Sophie Baker', '1999-06-05', 'sophie.baker@example.com', 'Media and Communication'),
(100029, 'Noah Hill', '2001-07-18', 'noah.hill@example.com', 'Applied Mathematics'),
(100030, 'Avery Mitchell', '2000-09-07', 'avery.mitchell@example.com', 'Biological Sciences'),
(100031, 'Gabriel Perez', '2002-10-25', 'gabriel.perez@example.com', 'Computer Engineering'),
(100032, 'Madison Roberts', '2001-12-20', 'madison.roberts@example.com', 'International Relations and Global Affairs'),
(100033, 'Elijah Campbell', '2003-08-13', 'elijah.campbell@example.com', 'Humanities and Language'),
(100034, 'Chloe Parker', '1999-11-02', 'chloe.parker@example.com', 'Food Science and Technology'),
(100035, 'Daniel Murphy', '2002-01-17', 'daniel.murphy@example.com', 'Creative Technology'),
(100036, 'Layla Gonzalez', '2003-02-26', 'layla.gonzalez@example.com', 'Communication Design'),
(100037, 'Henry Lopez', '2000-03-14', 'henry.lopez@example.com', 'Computer Science'),
(100038, 'Grace Phillips', '2001-04-08', 'grace.phillips@example.com', 'Business Administration'),
(100039, 'Samuel Hernandez', '2002-10-31', 'samuel.hernandez@example.com', 'Chemistry'),
(100040, 'Aubrey Carter', '2003-09-21', 'aubrey.carter@example.com', 'Media and Communication'),
(100041, 'Sebastian Evans', '2000-05-12', 'sebastian.evans@example.com', 'Applied Mathematics'),
(100042, 'Isabelle Collins', '2001-08-16', 'isabelle.collins@example.com', 'Biological Sciences'),
(100043, 'Julian Turner', '2002-11-27', 'julian.turner@example.com', 'Computer Engineering'),
(100044, 'Maya Rivera', '2003-07-14', 'maya.rivera@example.com', 'International Relations and Global Affairs'),
(100045, 'Jackson Ward', '1999-09-09', 'jackson.ward@example.com', 'Humanities and Language'),
(100046, 'Harper Lee', '2000-12-05', 'harper.lee@example.com', 'Food Science and Technology'),
(100047, 'Mason Morris', '2001-02-18', 'mason.morris@example.com', 'Creative Technology'),
(100048, 'Ella Cook', '2003-03-22', 'ella.cook@example.com', 'Communication Design'),
(100049, 'Oliver Bailey', '2000-06-30', 'oliver.bailey@example.com', 'Computer Science'),
(100050, 'Ava Diaz', '2002-10-15', 'ava.diaz@example.com', 'Business Administration');

INSERT INTO PersonalInfo (studentId, address, phoneNumber, email, emergencyContact) VALUES
(100001, '123 Elm St, Springfield', '555-0101', 'john.doe@example.com', '555-0102'),
(100002, '456 Oak St, Riverdale', '555-0201', 'jane.smith@example.com', '555-0202'),
(100003, '789 Pine St, Centerville', '555-0301', 'alice.j@example.com', '555-0302'),
(100004, '321 Maple St, Smalltown', '555-0401', 'chris.lee@example.com', '555-0402'),
(100005, '654 Birch St, Lakeside', '555-0501', 'david.brown@example.com', '555-0502'),
(100006, '987 Cedar St, Hillcrest', '555-0601', 'emma.wilson@example.com', '555-0602'),
(100007, '159 Spruce St, Eastwood', '555-0701', 'michael.davis@example.com', '555-0702'),
(100008, '753 Walnut St, Westgate', '555-0801', 'sophia.m@example.com', '555-0802'),
(100009, '357 Ash St, Northview', '555-0901', 'james.taylor@example.com', '555-0902'),
(100010, '951 Poplar St, Southgate', '555-1001', 'isabella.t@example.com', '555-1002'),
(100011, '121 Cherry St, Eastside', '555-1101', 'william.jackson@example.com', '555-1102'),
(100012, '482 Sycamore St, Westside', '555-1201', 'olivia.harris@example.com', '555-1202'),
(100013, '364 Magnolia St, Oldtown', '555-1301', 'lucas.clark@example.com', '555-1302'),
(100014, '276 Willow St, Newtown', '555-1401', 'charlotte.lewis@example.com', '555-1402'),
(100015, '389 Palm St, Creekwood', '555-1501', 'ethan.walker@example.com', '555-1502'),
(100016, '512 Elm St, Springfield', '555-1601', 'mia.hall@example.com', '555-1602'),
(100017, '623 Oak St, Riverdale', '555-1701', 'benjamin.allen@example.com', '555-1702'),
(100018, '734 Pine St, Centerville', '555-1801', 'amelia.young@example.com', '555-1802'),
(100019, '845 Maple St, Smalltown', '555-1901', 'alexander.moore@example.com', '555-1902'),
(100020, '956 Birch St, Lakeside', '555-2001', 'evelyn.martin@example.com', '555-2002'),
(100021, '167 Cedar St, Hillcrest', '555-2101', 'logan.anderson@example.com', '555-2102'),
(100022, '278 Spruce St, Eastwood', '555-2201', 'lily.white@example.com', '555-2202'),
(100023, '389 Walnut St, Westgate', '555-2301', 'jacob.wright@example.com', '555-2302'),
(100024, '490 Ash St, Northview', '555-2401', 'aria.king@example.com', '555-2402'),
(100025, '501 Poplar St, Southgate', '555-2501', 'nathan.scott@example.com', '555-2502'),
(100026, '612 Cherry St, Eastside', '555-2601', 'zoey.adams@example.com', '555-2602'),
(100027, '723 Sycamore St, Westside', '555-2701', 'liam.nelson@example.com', '555-2702'),
(100028, '834 Magnolia St, Oldtown', '555-2801', 'sophie.baker@example.com', '555-2802'),
(100029, '945 Willow St, Newtown', '555-2901', 'noah.hill@example.com', '555-2902'),
(100030, '056 Palm St, Creekwood', '555-3001', 'avery.mitchell@example.com', '555-3002'),
(100031, '967 Elm St, Springfield', '555-3101', 'gabriel.perez@example.com', '555-3102'),
(100032, '178 Oak St, Riverdale', '555-3201', 'madison.roberts@example.com', '555-3202'),
(100033, '289 Pine St, Centerville', '555-3301', 'elijah.campbell@example.com', '555-3302'),
(100034, '390 Maple St, Smalltown', '555-3401', 'chloe.parker@example.com', '555-3402'),
(100035, '401 Birch St, Lakeside', '555-3501', 'daniel.murphy@example.com', '555-3502'),
(100036, '512 Cedar St, Hillcrest', '555-3601', 'layla.gonzalez@example.com', '555-3602'),
(100037, '623 Spruce St, Eastwood', '555-3701', 'henry.lopez@example.com', '555-3702'),
(100038, '734 Walnut St, Westgate', '555-3801', 'grace.phillips@example.com', '555-3802'),
(100039, '845 Ash St, Northview', '555-3901', 'samuel.hernandez@example.com', '555-3902'),
(100040, '956 Poplar St, Southgate', '555-4001', 'aubrey.carter@example.com', '555-4002'),
(100041, '067 Cherry St, Eastside', '555-4101', 'sebastian.evans@example.com', '555-4102'),
(100042, '178 Sycamore St, Westside', '555-4201', 'isabelle.collins@example.com', '555-4202'),
(100043, '289 Magnolia St, Oldtown', '555-4301', 'julian.turner@example.com', '555-4302'),
(100044, '390 Willow St, Newtown', '555-4401', 'maya.rivera@example.com', '555-4402'),
(100045, '401 Palm St, Creekwood', '555-4501', 'jackson.ward@example.com', '555-4502'),
(100046, '512 Elm St, Springfield', '555-4601', 'harper.lee@example.com', '555-4602'),
(100047, '623 Oak St, Riverdale', '555-4701', 'mason.morris@example.com', '555-4702'),
(100048, '734 Pine St, Centerville', '555-4801', 'ella.cook@example.com', '555-4802'),
(100049, '845 Maple St, Smalltown', '555-4901', 'oliver.bailey@example.com', '555-4902'),
(100050, '956 Birch St, Lakeside', '555-5001', 'ava.diaz@example.com', '555-5002');

INSERT INTO Instructor (instructorId, name, department, contractInfo) VALUES
(1, 'Dr. Alan Turing', 'Computer Science', 'alan.turing@university.edu'),
(2, 'Dr. Marie Curie', 'Chemistry', 'marie.curie@university.edu'),
(3, 'Prof. Ada Lovelace', 'Mathematics', 'ada.lovelace@university.edu'),
(4, 'Dr. Carl Sagan', 'Physics', 'carl.sagan@university.edu'),
(5, 'Prof. Jane Goodall', 'Biology', 'jane.goodall@university.edu');

INSERT INTO Course (courseId, courseName, credits, schedule, location, instructorId) VALUES
(1, 'Introduction to Programming', 3, 'MWF 9:00-10:00', 'Room 101', 1),
(2, 'Principles of Chemistry', 3, 'TTh 10:00-11:30', 'Room 201', 2),
(3, 'Calculus I', 4, 'MWF 11:00-12:00', 'Room 301', 3),
(4, 'Astrophysics Basics', 3, 'TTh 9:00-10:30', 'Room 401', 4),
(5, 'Biology Fundamentals', 4, 'MWF 10:00-11:00', 'Room 501', 5),
(6, 'Algorithms and Data Structures', 4, 'MWF 13:00-14:00', 'Room 102', 1),
(7, 'Organic Chemistry', 3, 'TTh 11:00-12:30', 'Room 202', 2),
(8, 'Statistics for Scientists', 3, 'MWF 14:00-15:00', 'Room 302', 3),
(9, 'General Relativity', 3, 'TTh 12:00-13:30', 'Room 402', 4),
(10, 'Ecology and Environment', 4, 'MWF 15:00-16:00', 'Room 502', 5),
(11, 'Machine Learning', 3, 'TTh 14:00-15:30', 'Room 103', 1),
(12, 'Advanced Inorganic Chemistry', 4, 'MWF 16:00-17:00', 'Room 203', 2),
(13, 'Applied Mathematics', 4, 'TTh 15:00-16:30', 'Room 303', 3),
(14, 'Quantum Mechanics', 4, 'MWF 17:00-18:00', 'Room 403', 4),
(15, 'Genetics', 4, 'TTh 16:00-17:30', 'Room 503', 5);

INSERT INTO Facility (facilityId, facilityName, facilityType, location) VALUES
(1, 'Central Library', 'Library', 'Building A, Floor 2'),
(2, 'Fitness Center', 'Gym', 'Building B, Ground Floor'),
(3, 'Computer Lab', 'Lab', 'Building C, Floor 3'),
(4, 'Auditorium', 'Auditorium', 'Building D, Floor 1'),
(5, 'Swimming Pool', 'Pool', 'Building E, Outdoor Area'),
(6, 'Music Room', 'Recreation', 'Building F, Floor 1'),
(7, 'Cafeteria', 'Dining', 'Building G, Ground Floor'),
(8, 'Basketball Court', 'Sports', 'Building H, Outdoor Area'),
(9, 'Research Lab', 'Lab', 'Building I, Floor 5'),
(10, 'Art Studio', 'Studio', 'Building J, Floor 1'),
(11, 'Tennis Court', 'Sports', 'Building K, Outdoor Area'),
(12, 'Medical Center', 'Health', 'Building L, Ground Floor'),
(13, 'Lecture Hall 101', 'Lecture Hall', 'Building M, Floor 2'),
(14, 'Gaming Lounge', 'Recreation', 'Building N, Basement'),
(15, 'Conference Room A', 'Conference', 'Building O, Floor 3'),
(16, 'Greenhouse', 'Research', 'Building P, Roof'),
(17, 'Robotics Lab', 'Lab', 'Building Q, Floor 4'),
(18, 'Dance Studio', 'Studio', 'Building R, Floor 2'),
(19, 'Cycling Room', 'Gym', 'Building S, Ground Floor'),
(20, 'Drama Theatre', 'Auditorium', 'Building T, Floor 1');

INSERT INTO FacilityUsage (reservationId, studentId, facilityId, usageDateTime, duration) VALUES
(1, 100001, 1, '2024-12-01 08:30:00', 2),
(2, 100002, 2, '2024-12-01 09:00:00', 1),
(3, 100003, 3, '2024-12-01 10:15:00', 3),
(4, 100004, 4, '2024-12-01 11:00:00', 1),
(5, 100005, 5, '2024-12-01 12:00:00', 2),
(6, 100006, 6, '2024-12-01 13:30:00', 1),
(7, 100007, 7, '2024-12-01 14:00:00', 3),
(8, 100008, 8, '2024-12-01 15:45:00', 1),
(9, 100009, 9, '2024-12-01 16:30:00', 2),
(10, 100010, 10, '2024-12-02 08:00:00', 1),
(11, 100011, 11, '2024-12-02 09:15:00', 3),
(12, 100012, 12, '2024-12-02 10:00:00', 2),
(13, 100013, 13, '2024-12-02 11:30:00', 1),
(14, 100014, 14, '2024-12-02 13:00:00', 1),
(15, 100015, 15, '2024-12-02 14:30:00', 2),
(16, 100016, 16, '2024-12-02 15:00:00', 1),
(17, 100017, 17, '2024-12-02 16:30:00', 2),
(18, 100018, 18, '2024-12-03 08:00:00', 3),
(19, 100019, 19, '2024-12-03 09:30:00', 2),
(20, 100020, 20, '2024-12-03 10:00:00', 1),
(21, 100021, 1, '2024-12-03 12:00:00', 3),
(22, 100022, 2, '2024-12-03 13:30:00', 1),
(23, 100023, 3, '2024-12-03 14:00:00', 2),
(24, 100024, 4, '2024-12-03 15:00:00', 1),
(25, 100025, 5, '2024-12-03 16:30:00', 3),
(26, 100026, 6, '2024-12-04 08:00:00', 2),
(27, 100027, 7, '2024-12-04 09:15:00', 1),
(28, 100028, 8, '2024-12-04 10:00:00', 3),
(29, 100029, 9, '2024-12-04 11:30:00', 2),
(30, 100030, 10, '2024-12-04 12:15:00', 1),
(31, 100031, 11, '2024-12-04 13:30:00', 3),
(32, 100032, 12, '2024-12-04 14:00:00', 2),
(33, 100033, 13, '2024-12-04 15:00:00', 1),
(34, 100034, 14, '2024-12-04 16:00:00', 3),
(35, 100035, 15, '2024-12-05 08:00:00', 2),
(36, 100036, 16, '2024-12-05 09:00:00', 1),
(37, 100037, 17, '2024-12-05 10:30:00', 2),
(38, 100038, 18, '2024-12-05 11:00:00', 3),
(39, 100039, 19, '2024-12-05 12:00:00', 1),
(40, 100040, 20, '2024-12-05 13:30:00', 2);

INSERT INTO Enrollment (enrollmentId, studentId, courseId, semester, grade, credits) VALUES
(1, 100001, 1, 'Fall 2023', 'A', 4),
(2, 100001, 6, 'Fall 2023', 'A-', 4),
(3, 100001, 11, 'Fall 2023', 'B+', 4),
(4, 100002, 2, 'Fall 2023', 'B', 4),
(5, 100002, 7, 'Fall 2023', 'C', 4),
(6, 100003, 3, 'Fall 2023', 'B', 4),
(7, 100003, 8, 'Fall 2023', 'A-', 4),
(8, 100004, 4, 'Fall 2023', 'A', 4),
(9, 100004, 9, 'Fall 2023', 'B+', 4),
(10, 100005, 5, 'Fall 2023', 'B', 4),
(11, 100005, 10, 'Fall 2023', 'A-', 4),
(12, 100005, 15, 'Fall 2023', 'B+', 4),
(13, 100006, 6, 'Fall 2023', 'A', 4),
(14, 100006, 10, 'Fall 2023', 'B+', 4),
(15, 100007, 11, 'Fall 2023', 'A-', 4),
(16, 100007, 1, 'Fall 2023', 'B', 4),
(17, 100008, 12, 'Fall 2023', 'B+', 4),
(18, 100008, 7, 'Fall 2023', 'C+', 4),
(19, 100009, 13, 'Fall 2023', 'A', 4),
(20, 100009, 3, 'Fall 2023', 'B-', 4),
(21, 100010, 14, 'Fall 2023', 'A-', 4),
(22, 100010, 9, 'Fall 2023', 'B', 4),
(23, 100011, 5, 'Fall 2023', 'A', 4),
(24, 100011, 10, 'Fall 2023', 'B+', 4),
(25, 100012, 2, 'Fall 2023', 'B-', 4),
(26, 100012, 7, 'Fall 2023', 'C+', 4),
(27, 100013, 1, 'Fall 2023', 'A-', 4),
(28, 100013, 6, 'Fall 2023', 'B+', 4),
(29, 100014, 3, 'Fall 2023', 'B', 4),
(30, 100014, 8, 'Fall 2023', 'A', 4),
(31, 100015, 4, 'Fall 2023', 'A-', 4),
(32, 100015, 9, 'Fall 2023', 'B+', 4),
(33, 100015, 14, 'Fall 2023', 'A', 4),
(34, 100016, 1, 'Fall 2023', 'B+', 4),
(35, 100016, 5, 'Fall 2023', 'A', 4),
(36, 100016, 12, 'Fall 2023', 'B', 4),
(37, 100017, 2, 'Fall 2023', 'A-', 4),
(38, 100017, 10, 'Fall 2023', 'C+', 4),
(39, 100017, 15, 'Fall 2023', 'B-', 4),
(40, 100018, 3, 'Fall 2023', 'B+', 4),
(41, 100018, 8, 'Fall 2023', 'A-', 4),
(42, 100018, 13, 'Fall 2023', 'A', 4),
(43, 100019, 4, 'Fall 2023', 'B-', 4),
(44, 100019, 9, 'Fall 2023', 'B+', 4),
(45, 100019, 14, 'Fall 2023', 'A-', 4),
(46, 100020, 5, 'Fall 2023', 'C', 4),
(47, 100020, 10, 'Fall 2023', 'B', 4),
(48, 100020, 15, 'Fall 2023', 'A-', 4),
(49, 100021, 2, 'Fall 2023', 'A', 4),
(50, 100021, 7, 'Fall 2023', 'B+', 4),
(51, 100021, 12, 'Fall 2023', 'B', 4),
(52, 100022, 3, 'Fall 2023', 'A-', 4),
(53, 100022, 8, 'Fall 2023', 'C+', 4),
(54, 100022, 13, 'Fall 2023', 'A', 4),
(55, 100023, 4, 'Fall 2023', 'B-', 4),
(56, 100023, 9, 'Fall 2023', 'B+', 4),
(57, 100023, 14, 'Fall 2023', 'B', 4),
(58, 100024, 1, 'Fall 2023', 'A-', 4),
(59, 100024, 6, 'Fall 2023', 'C', 4),
(60, 100024, 11, 'Fall 2023', 'A', 4),
(61, 100025, 2, 'Fall 2023', 'B+', 4),
(62, 100025, 7, 'Fall 2023', 'A-', 4),
(63, 100025, 12, 'Fall 2023', 'B', 4),
(64, 100026, 3, 'Fall 2023', 'C+', 4),
(65, 100026, 8, 'Fall 2023', 'B-', 4),
(66, 100026, 13, 'Fall 2023', 'A-', 4),
(67, 100027, 4, 'Fall 2023', 'B', 4),
(68, 100027, 9, 'Fall 2023', 'A', 4),
(69, 100027, 14, 'Fall 2023', 'B+', 4),
(70, 100028, 5, 'Fall 2023', 'A-', 4),
(71, 100028, 10, 'Fall 2023', 'C', 4),
(72, 100028, 15, 'Fall 2023', 'B-', 4),
(73, 100029, 1, 'Fall 2023', 'A', 4),
(74, 100029, 6, 'Fall 2023', 'B+', 4),
(75, 100029, 11, 'Fall 2023', 'B', 4),
(76, 100030, 2, 'Fall 2023', 'A-', 4),
(77, 100030, 7, 'Fall 2023', 'B-', 4),
(78, 100030, 12, 'Fall 2023', 'C+', 4),
(79, 100031, 1, 'Fall 2023', 'B', 4),
(80, 100031, 6, 'Fall 2023', 'A-', 4),
(81, 100032, 2, 'Fall 2023', 'C+', 4),
(82, 100032, 7, 'Fall 2023', 'B+', 4),
(83, 100033, 3, 'Fall 2023', 'A', 4),
(84, 100033, 8, 'Fall 2023', 'B', 4),
(85, 100034, 4, 'Fall 2023', 'B-', 4),
(86, 100034, 9, 'Fall 2023', 'A-', 4),
(87, 100035, 5, 'Fall 2023', 'C', 4),
(88, 100035, 10, 'Fall 2023', 'B+', 4),
(89, 100036, 1, 'Fall 2023', 'A', 4),
(90, 100036, 11, 'Fall 2023', 'A-', 4),
(91, 100037, 2, 'Fall 2023', 'B', 4),
(92, 100037, 12, 'Fall 2023', 'C+', 4),
(93, 100038, 3, 'Fall 2023', 'B-', 4),
(94, 100038, 13, 'Fall 2023', 'A', 4),
(95, 100039, 4, 'Fall 2023', 'A-', 4),
(96, 100039, 14, 'Fall 2023', 'B+', 4),
(97, 100040, 5, 'Fall 2023', 'C', 4),
(98, 100040, 15, 'Fall 2023', 'B', 4),
(99, 100041, 1, 'Fall 2023', 'B+', 4),
(100, 100041, 6, 'Fall 2023', 'A-', 4),
(101, 100042, 2, 'Fall 2023', 'A', 4),
(102, 100042, 7, 'Fall 2023', 'B-', 4),
(103, 100043, 3, 'Fall 2023', 'C+', 4),
(104, 100043, 8, 'Fall 2023', 'A-', 4),
(105, 100044, 4, 'Fall 2023', 'B', 4),
(106, 100044, 9, 'Fall 2023', 'A', 4),
(107, 100045, 5, 'Fall 2023', 'A-', 4),
(108, 100045, 10, 'Fall 2023', 'B+', 4),
(109, 100046, 1, 'Fall 2023', 'C', 4),
(110, 100046, 11, 'Fall 2023', 'B', 4),
(111, 100047, 2, 'Fall 2023', 'B-', 4),
(112, 100047, 12, 'Fall 2023', 'A-', 4),
(113, 100048, 3, 'Fall 2023', 'A', 4),
(114, 100048, 13, 'Fall 2023', 'C+', 4),
(115, 100049, 4, 'Fall 2023', 'B+', 4),
(116, 100049, 14, 'Fall 2023', 'B-', 4),
(117, 100050, 5, 'Fall 2023', 'A-', 4),
(118, 100050, 15, 'Fall 2023', 'A', 4);

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
50 rows affected.
50 rows affected.
5 rows affected.
15 rows affected.
20 rows affected.
40 rows affected.
118 rows affected.

[]

## Implmentation
![ER-Diagram](https://raw.githubusercontent.com/LKJTC/Database-Project/refs/heads/main/SitemapV2.png)

### Student and Enrollment Management

In [36]:
%%sql
-- List Students
SELECT * FROM Student;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
50 rows affected.

[(100001, 'John Doe', datetime.date(2001, 6, 15), 'john.doe@example.com', 'Computer Science'),
 (100002, 'Jane Smith', datetime.date(2002, 7, 20), 'jane.smith@example.com', 'Business Administration'),
 (100003, 'Alice Johnson', datetime.date(2000, 9, 10), 'alice.j@example.com', 'Chemistry'),
 (100004, 'Chris Lee', datetime.date(2003, 11, 25), 'chris.lee@example.com', 'Media and Communication'),
 (100005, 'David Brown', datetime.date(1999, 1, 30), 'david.brown@example.com', 'Applied Mathematics'),
 (100006, 'Emma Wilson', datetime.date(2002, 5, 22), 'emma.wilson@example.com', 'Biological Sciences'),
 (100007, 'Michael Davis', datetime.date(2001, 3, 18), 'michael.davis@example.com', 'Computer Engineering'),
 (100008, 'Sophia Martinez', datetime.date(2002, 8, 15), 'sophia.m@example.com', 'International Relations and Global Affairs'),
 (100009, 'James Taylor', datetime.date(2001, 2, 9), 'james.taylor@example.com', 'Humanities and Language'),
 (100010, 'Isabella Thomas', datetime.date(2003, 12, 12), 'isabella.t@example.com', 'Food Science and Technology'),
 (100011, 'William Jackson', datetime.date(2001, 10, 14), 'william.jackson@example.com', 'Creative Technology'),
 (100012, 'Olivia Harris', datetime.date(1998, 4, 23), 'olivia.harris@example.com', 'Communication Design'),
 (100013, 'Lucas Clark', datetime.date(2002, 6, 30), 'lucas.clark@example.com', 'Computer Science'),
 (100014, 'Charlotte Lewis', datetime.date(1999, 7, 19), 'charlotte.lewis@example.com', 'Business Administration'),
 (100015, 'Ethan Walker', datetime.date(2000, 8, 25), 'ethan.walker@example.com', 'Chemistry'),
 (100016, 'Mia Hall', datetime.date(2003, 9, 15), 'mia.hall@example.com', 'Media and Communication'),
 (100017, 'Benjamin Allen', datetime.date(1998, 10, 5), 'benjamin.allen@example.com', 'Applied Mathematics'),
 (100018, 'Amelia Young', datetime.date(2001, 11, 11), 'amelia.young@example.com', 'Biological Sciences'),
 (100019, 'Alexander Moore', datetime.date(2002, 12, 22), 'alexander.moore@example.com', 'Computer Engineering'),
 (100020, 'Evelyn Martin', datetime.date(2003, 3, 30), 'evelyn.martin@example.com', 'International Relations and Global Affairs'),
 (100021, 'Logan Anderson', datetime.date(1999, 5, 1), 'logan.anderson@example.com', 'Humanities and Language'),
 (100022, 'Lily White', datetime.date(2002, 7, 24), 'lily.white@example.com', 'Food Science and Technology'),
 (100023, 'Jacob Wright', datetime.date(2001, 1, 19), 'jacob.wright@example.com', 'Creative Technology'),
 (100024, 'Aria King', datetime.date(2003, 4, 3), 'aria.king@example.com', 'Communication Design'),
 (100025, 'Nathan Scott', datetime.date(2000, 2, 28), 'nathan.scott@example.com', 'Computer Science'),
 (100026, 'Zoey Adams', datetime.date(2002, 3, 15), 'zoey.adams@example.com', 'Business Administration'),
 (100027, 'Liam Nelson', datetime.date(2003, 5, 10), 'liam.nelson@example.com', 'Chemistry'),
 (100028, 'Sophie Baker', datetime.date(1999, 6, 5), 'sophie.baker@example.com', 'Media and Communication'),
 (100029, 'Noah Hill', datetime.date(2001, 7, 18), 'noah.hill@example.com', 'Applied Mathematics'),
 (100030, 'Avery Mitchell', datetime.date(2000, 9, 7), 'avery.mitchell@example.com', 'Biological Sciences'),
 (100031, 'Gabriel Perez', datetime.date(2002, 10, 25), 'gabriel.perez@example.com', 'Computer Engineering'),
 (100032, 'Madison Roberts', datetime.date(2001, 12, 20), 'madison.roberts@example.com', 'International Relations and Global Affairs'),
 (100033, 'Elijah Campbell', datetime.date(2003, 8, 13), 'elijah.campbell@example.com', 'Humanities and Language'),
 (100034, 'Chloe Parker', datetime.date(1999, 11, 2), 'chloe.parker@example.com', 'Food Science and Technology'),
 (100035, 'Daniel Murphy', datetime.date(2002, 1, 17), 'daniel.murphy@example.com', 'Creative Technology'),
 (100036, 'Layla Gonzalez', datetime.date(2003, 2, 26), 'layla.gonzalez@example.com', 'Communication Design'),
 (100037, 'Henry Lopez', datetime.date(2000, 3, 14), 'henry.lopez@example.com', 'Computer Science'),
 (100038, 'Grace Phillips', datetime.date(2001, 4, 8), 'grace.phillips@example.com', 'Business Administration'),
 (100039, 'Samuel Hernandez', datetime.date(2002, 10, 31), 'samuel.hernandez@example.com', 'Chemistry'),
 (100040, 'Aubrey Carter', datetime.date(2003, 9, 21), 'aubrey.carter@example.com', 'Media and Communication'),
 (100041, 'Sebastian Evans', datetime.date(2000, 5, 12), 'sebastian.evans@example.com', 'Applied Mathematics'),
 (100042, 'Isabelle Collins', datetime.date(2001, 8, 16), 'isabelle.collins@example.com', 'Biological Sciences'),
 (100043, 'Julian Turner', datetime.date(2002, 11, 27), 'julian.turner@example.com', 'Computer Engineering'),
 (100044, 'Maya Rivera', datetime.date(2003, 7, 14), 'maya.rivera@example.com', 'International Relations and Global Affairs'),
 (100045, 'Jackson Ward', datetime.date(1999, 9, 9), 'jackson.ward@example.com', 'Humanities and Language'),
 (100046, 'Harper Lee', datetime.date(2000, 12, 5), 'harper.lee@example.com', 'Food Science and Technology'),
 (100047, 'Mason Morris', datetime.date(2001, 2, 18), 'mason.morris@example.com', 'Creative Technology'),
 (100048, 'Ella Cook', datetime.date(2003, 3, 22), 'ella.cook@example.com', 'Communication Design'),
 (100049, 'Oliver Bailey', datetime.date(2000, 6, 30), 'oliver.bailey@example.com', 'Computer Science'),
 (100050, 'Ava Diaz', datetime.date(2002, 10, 15), 'ava.diaz@example.com', 'Business Administration')]

In [37]:
%%sql
-- Add Student
INSERT INTO Student (studentId, name, birthDate, contactInfo, major)
VALUES (100051, 'New Student', '2003-01-01', 'new.student@example.com', 'Computer Science');

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.

[]

In [38]:
%%sql
-- Edit Student
UPDATE Student
SET name = 'Updated Name', birthDate = '2003-01-02', contactInfo = 'updated.student@example.com', major = 'Biology'
WHERE studentId = 100051;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.

[]

In [39]:
%%sql
-- Delete Student
DELETE FROM Student WHERE studentId = 100051;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.

[]

In [40]:
%%sql
-- Enroll in Courses
INSERT INTO Enrollment (enrollmentId, studentId, courseId, semester, grade, credits)
VALUES (200, 100051, 1, 'Spring 2024', 'In Progess', 4);

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.StringDataRightTruncation) value too long for type character(2)

[SQL: -- Enroll in Courses
INSERT INTO Enrollment (enrollmentId, studentId, courseId, semester, grade, credits)
VALUES (200, 100051, 1, 'Spring 2024', 'In Progess', 4);]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

In [41]:
%%sql
-- View Enrollment
SELECT e.semester, c.courseName, e.grade, e.credits
FROM Enrollment e
JOIN Course c ON e.courseId = c.courseId
WHERE e.studentId = 100001;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
3 rows affected.

[('Fall 2023', 'Introduction to Programming', 'A ', 4),
 ('Fall 2023', 'Algorithms and Data Structures', 'A-', 4),
 ('Fall 2023', 'Machine Learning', 'B+', 4)]

In [42]:
%%sql
-- Update Enrollment Details
UPDATE Enrollment
SET grade = 'F', credits = 4
WHERE enrollmentId = 200;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
0 rows affected.

[]

### Courses and Schedule

In [43]:
%%sql
-- List all courses
SELECT courseId, courseName, credits, schedule, location, instructorId
FROM Courses;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.UndefinedTable) relation "courses" does not exist
LINE 3: FROM Courses;
             ^

[SQL: -- List all courses
SELECT courseId, courseName, credits, schedule, location, instructorId
FROM Courses;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [44]:
%%sql
-- Add a new course
INSERT INTO Courses (courseId, courseName, credits, schedule, location, instructorId)
VALUES
    (101, 'Database Management Systems', 3, 'MWF 10:00-11:00 AM', 'Room 101', 1),
    (102, 'Artificial Intelligence', 4, 'TTh 2:00-4:00 PM', 'Room 102', 2);

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.UndefinedTable) relation "courses" does not exist
LINE 2: INSERT INTO Courses (courseId, courseName, credits, schedule...
                    ^

[SQL: -- Add a new course
INSERT INTO Courses (courseId, courseName, credits, schedule, location, instructorId)
VALUES
    (101, 'Database Management Systems', 3, 'MWF 10:00-11:00 AM', 'Room 101', 1),
    (102, 'Artificial Intelligence', 4, 'TTh 2:00-4:00 PM', 'Room 102', 2);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [45]:
%%sql
-- Edit course details
UPDATE Courses
SET schedule = 'MWF 9:00-10:00 AM', location = 'Room 202'
WHERE courseId = 101;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.UndefinedTable) relation "courses" does not exist
LINE 2: UPDATE Courses
               ^

[SQL: -- Edit course details
UPDATE Courses
SET schedule = 'MWF 9:00-10:00 AM', location = 'Room 202'
WHERE courseId = 101;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [46]:
%%sql
-- Delete a course by courseId
DELETE FROM Courses
WHERE courseId = 101;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.UndefinedTable) relation "courses" does not exist
LINE 2: DELETE FROM Courses
                    ^

[SQL: -- Delete a course by courseId
DELETE FROM Courses
WHERE courseId = 101;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [47]:
%%sql
-- View course schedules
SELECT c.courseName, s.scheduleDate, s.startTime, s.endTime
FROM Schedules s
JOIN Courses c ON s.courseId = c.courseId;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.UndefinedTable) relation "schedules" does not exist
LINE 3: FROM Schedules s
             ^

[SQL: -- View course schedules
SELECT c.courseName, s.scheduleDate, s.startTime, s.endTime
FROM Schedules s
JOIN Courses c ON s.courseId = c.courseId;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [48]:
%%sql
-- Edit course schedule
UPDATE Schedules
SET scheduleDate = '2024-12-15', startTime = '10:00:00', endTime = '12:00:00'
WHERE scheduleId = 1;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.UndefinedTable) relation "schedules" does not exist
LINE 2: UPDATE Schedules
               ^

[SQL: -- Edit course schedule
UPDATE Schedules
SET scheduleDate = '2024-12-15', startTime = '10:00:00', endTime = '12:00:00'
WHERE scheduleId = 1;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [49]:
%%sql
-- Assign instructor to a course
UPDATE Courses
SET instructorId = 3
WHERE courseId = 102;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
(psycopg2.errors.UndefinedTable) relation "courses" does not exist
LINE 2: UPDATE Courses
               ^

[SQL: -- Assign instructor to a course
UPDATE Courses
SET instructorId = 3
WHERE courseId = 102;]
(Background on this error at: https://sqlalche.me/e/20/f405)
(psycopg2.errors.UndefinedTable) relation "courses" does not exist
LINE 2: UPDATE Courses
               ^

[SQL: -- Assign instructor to a course
UPDATE Courses
SET instructorId = 3
WHERE courseId = 102;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Facilities and Usage

In [50]:
%%sql
-- List all facilities
SELECT facilityId, facilityName, location
FROM Facility;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
20 rows affected.

[(1, 'Central Library', 'Building A, Floor 2'),
 (2, 'Fitness Center', 'Building B, Ground Floor'),
 (3, 'Computer Lab', 'Building C, Floor 3'),
 (4, 'Auditorium', 'Building D, Floor 1'),
 (5, 'Swimming Pool', 'Building E, Outdoor Area'),
 (6, 'Music Room', 'Building F, Floor 1'),
 (7, 'Cafeteria', 'Building G, Ground Floor'),
 (8, 'Basketball Court', 'Building H, Outdoor Area'),
 (9, 'Research Lab', 'Building I, Floor 5'),
 (10, 'Art Studio', 'Building J, Floor 1'),
 (11, 'Tennis Court', 'Building K, Outdoor Area'),
 (12, 'Medical Center', 'Building L, Ground Floor'),
 (13, 'Lecture Hall 101', 'Building M, Floor 2'),
 (14, 'Gaming Lounge', 'Building N, Basement'),
 (15, 'Conference Room A', 'Building O, Floor 3'),
 (16, 'Greenhouse', 'Building P, Roof'),
 (17, 'Robotics Lab', 'Building Q, Floor 4'),
 (18, 'Dance Studio', 'Building R, Floor 2'),
 (19, 'Cycling Room', 'Building S, Ground Floor'),
 (20, 'Drama Theatre', 'Building T, Floor 1')]

In [51]:
%%sql
-- Add a new facility
INSERT INTO Facility (facilityId, facilityName, facilityType, location)
VALUES (22, 'Conference Room', 'Conference', 'Building B');

INSERT INTO Facility (facilityId, facilityName, facilityType, location)
VALUES (23, 'Research Lab', 'Lab', 'Building C');

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.
1 rows affected.

[]

In [52]:
%%sql
-- Delete a facility
DELETE FROM Facility
WHERE facilityId = 22;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.

[]

In [53]:
%%sql
-- List all facility usage with facility name and student name
SELECT fu.reservationId, s.name AS studentName, f.facilityName, fu.usageDateTime, fu.duration
FROM FacilityUsage fu
JOIN Student s ON fu.studentId = s.studentId
JOIN Facility f ON fu.facilityId = f.facilityId;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
40 rows affected.

[(1, 'John Doe', 'Central Library', datetime.datetime(2024, 12, 1, 8, 30), 2),
 (2, 'Jane Smith', 'Fitness Center', datetime.datetime(2024, 12, 1, 9, 0), 1),
 (3, 'Alice Johnson', 'Computer Lab', datetime.datetime(2024, 12, 1, 10, 15), 3),
 (4, 'Chris Lee', 'Auditorium', datetime.datetime(2024, 12, 1, 11, 0), 1),
 (5, 'David Brown', 'Swimming Pool', datetime.datetime(2024, 12, 1, 12, 0), 2),
 (6, 'Emma Wilson', 'Music Room', datetime.datetime(2024, 12, 1, 13, 30), 1),
 (7, 'Michael Davis', 'Cafeteria', datetime.datetime(2024, 12, 1, 14, 0), 3),
 (8, 'Sophia Martinez', 'Basketball Court', datetime.datetime(2024, 12, 1, 15, 45), 1),
 (9, 'James Taylor', 'Research Lab', datetime.datetime(2024, 12, 1, 16, 30), 2),
 (10, 'Isabella Thomas', 'Art Studio', datetime.datetime(2024, 12, 2, 8, 0), 1),
 (11, 'William Jackson', 'Tennis Court', datetime.datetime(2024, 12, 2, 9, 15), 3),
 (12, 'Olivia Harris', 'Medical Center', datetime.datetime(2024, 12, 2, 10, 0), 2),
 (13, 'Lucas Clark', 'Lecture Hall 101', datetime.datetime(2024, 12, 2, 11, 30), 1),
 (14, 'Charlotte Lewis', 'Gaming Lounge', datetime.datetime(2024, 12, 2, 13, 0), 1),
 (15, 'Ethan Walker', 'Conference Room A', datetime.datetime(2024, 12, 2, 14, 30), 2),
 (16, 'Mia Hall', 'Greenhouse', datetime.datetime(2024, 12, 2, 15, 0), 1),
 (17, 'Benjamin Allen', 'Robotics Lab', datetime.datetime(2024, 12, 2, 16, 30), 2),
 (18, 'Amelia Young', 'Dance Studio', datetime.datetime(2024, 12, 3, 8, 0), 3),
 (19, 'Alexander Moore', 'Cycling Room', datetime.datetime(2024, 12, 3, 9, 30), 2),
 (20, 'Evelyn Martin', 'Drama Theatre', datetime.datetime(2024, 12, 3, 10, 0), 1),
 (21, 'Logan Anderson', 'Central Library', datetime.datetime(2024, 12, 3, 12, 0), 3),
 (22, 'Lily White', 'Fitness Center', datetime.datetime(2024, 12, 3, 13, 30), 1),
 (23, 'Jacob Wright', 'Computer Lab', datetime.datetime(2024, 12, 3, 14, 0), 2),
 (24, 'Aria King', 'Auditorium', datetime.datetime(2024, 12, 3, 15, 0), 1),
 (25, 'Nathan Scott', 'Swimming Pool', datetime.datetime(2024, 12, 3, 16, 30), 3),
 (26, 'Zoey Adams', 'Music Room', datetime.datetime(2024, 12, 4, 8, 0), 2),
 (27, 'Liam Nelson', 'Cafeteria', datetime.datetime(2024, 12, 4, 9, 15), 1),
 (28, 'Sophie Baker', 'Basketball Court', datetime.datetime(2024, 12, 4, 10, 0), 3),
 (29, 'Noah Hill', 'Research Lab', datetime.datetime(2024, 12, 4, 11, 30), 2),
 (30, 'Avery Mitchell', 'Art Studio', datetime.datetime(2024, 12, 4, 12, 15), 1),
 (31, 'Gabriel Perez', 'Tennis Court', datetime.datetime(2024, 12, 4, 13, 30), 3),
 (32, 'Madison Roberts', 'Medical Center', datetime.datetime(2024, 12, 4, 14, 0), 2),
 (33, 'Elijah Campbell', 'Lecture Hall 101', datetime.datetime(2024, 12, 4, 15, 0), 1),
 (34, 'Chloe Parker', 'Gaming Lounge', datetime.datetime(2024, 12, 4, 16, 0), 3),
 (35, 'Daniel Murphy', 'Conference Room A', datetime.datetime(2024, 12, 5, 8, 0), 2),
 (36, 'Layla Gonzalez', 'Greenhouse', datetime.datetime(2024, 12, 5, 9, 0), 1),
 (37, 'Henry Lopez', 'Robotics Lab', datetime.datetime(2024, 12, 5, 10, 30), 2),
 (38, 'Grace Phillips', 'Dance Studio', datetime.datetime(2024, 12, 5, 11, 0), 3),
 (39, 'Samuel Hernandez', 'Cycling Room', datetime.datetime(2024, 12, 5, 12, 0), 1),
 (40, 'Aubrey Carter', 'Drama Theatre', datetime.datetime(2024, 12, 5, 13, 30), 2)]

In [54]:
%%sql
-- Book a facility
INSERT INTO FacilityUsage (reservationId, studentId, facilityId, usageDateTime, duration)
VALUES (41, 100001, 23, '2024-12-06 09:00:00', 2);

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.

[]

In [55]:
%%sql
-- Edit an existing booking
UPDATE FacilityUsage
SET usageDateTime = '2024-12-06 10:00:00', duration = 3
WHERE reservationId = 41;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.

[]

In [56]:
%%sql
-- delete a facility booking
DELETE FROM FacilityUsage
WHERE reservationId = 40;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
1 rows affected.

[]

## Reports!

In [57]:
%%sql
-- Generate an enrollment report for a specific student
SELECT 
    s.name AS student_name,
    s.major AS student_major,
    c.courseName AS course_name,
    e.semester AS semester,
    e.grade AS grade,
    e.credits AS credits,
    i.name AS instructor_name,
    i.department AS instructor_department,
    c.schedule AS course_schedule,
    c.location AS course_location
FROM 
    Enrollment e
JOIN 
    Student s ON e.studentId = s.studentId
JOIN 
    Course c ON e.courseId = c.courseId
JOIN 
    Instructor i ON c.instructorId = i.instructorId
WHERE 
    s.studentId = 100001;

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
3 rows affected.

[('John Doe', 'Computer Science', 'Introduction to Programming', 'Fall 2023', 'A ', 4, 'Dr. Alan Turing', 'Computer Science', 'MWF 9:00-10:00', 'Room 101'),
 ('John Doe', 'Computer Science', 'Algorithms and Data Structures', 'Fall 2023', 'A-', 4, 'Dr. Alan Turing', 'Computer Science', 'MWF 13:00-14:00', 'Room 102'),
 ('John Doe', 'Computer Science', 'Machine Learning', 'Fall 2023', 'B+', 4, 'Dr. Alan Turing', 'Computer Science', 'TTh 14:00-15:30', 'Room 103')]

In [58]:
%%sql
-- Generate a facility usage report
SELECT 
    s.name AS student_name,
    f.facilityName AS facility_name,
    fu.usageDateTime AS usage_datetime,
    fu.duration AS usage_duration_minutes,
    f.facilityType AS facility_type,
    f.location AS facility_location
FROM 
    FacilityUsage fu
JOIN 
    Student s ON fu.studentId = s.studentId
JOIN 
    Facility f ON fu.facilityId = f.facilityId
WHERE 
    s.studentId = 100001  -- Replace with the specific student ID
ORDER BY 
    fu.usageDateTime DESC;  -- Orders the results by the most recent usage first

 * postgresql://root:***@dpg-ct8mtct2ng1s739nmubg-a.singapore-postgres.render.com/remote_pg_db_n6yo
2 rows affected.

[('John Doe', 'Research Lab', datetime.datetime(2024, 12, 6, 10, 0), 3, 'Lab', 'Building C'),
 ('John Doe', 'Central Library', datetime.datetime(2024, 12, 1, 8, 30), 2, 'Library', 'Building A, Floor 2')]